app/views/articles/show.html.erb

SELECT "remarks".* FROM "remarks" WHERE "remarks"."article_id" = ?  [["article_id", 2]]
---
  <h2 class= "all-comments">Comments</h2>
  <% @article.remarks.each do |remark| %>