app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Growing Azalea in Wisconsin"], ["updated_at", "2022-05-23 21:52:25.216073"], ["id", 4]]
---
  def update
    @article = Article.find(params[:id])
      if @article.update(article_params)