app/controllers/remarks_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "remarks" ("name", "comment", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Green Thumb"], ["comment", "I love azaleas"], ["article_id", 4], ["created_at", "2022-05-23 23:12:05.719580"], ["updated_at", "2022-05-23 23:12:05.719580"]]
---
  def create
    @article = Article.find(params[:article_id])
    @remark = @article.remarks.create(remark_params)